## DATAWRANGLINGINPYTHON/DATAWRANGLINGWITHPANDAS/DATAWRANGLINGINPYTHON DATAWRANGLINGWITHPANDAS 5 EXERCISE  ##
#### Please refer to module 1 of DataWranglingInPython - DataWranglingWithPandas for Tasks 1-4
#### Task 1
##### Import `pandas` as `pd` and numpy as `np`.
##### Import `path` from `Pathlib`.
##### Set the data directory using the data_dir variable.
#### Result:

In [1]:
import pandas as pd
import numpy as np

#### Task 2
##### Create a Pandas `Series` object from a list of groceries below. Assign it to `shopping_series` variable and print it.
- milk
- eggs
- peppers
- cheese
- tomatoes
##### Print out only the values of the Series.
#### Result:

In [ ]:
shopping_series = pd.Series(['milk', 'eggs', 'peppers', 'cheese', 'tomatoes'])
print(shopping_series)

In [ ]:
print(shopping_series.values)

In [ ]:
data = ['milk', 'eggs', 'peppers', 'cheese', 'tomatoes']
index = ['a', 'b', 'c', 'd', 'e']
series2 = pd.Series(data, index=index)
print(series2)

In [ ]:
print(series2['a'])

#### Task 3
##### Create a Pandas Date Series object starting from `January 1st 2019` and ending with `January 1st 2020` separated monthly. Assign the Series to `monthly_series` variable. Print the result.     
##### Create another Pandas Date Series object starting from `January 1st 2019` and covering 12 monthly periods. Assign the Series to `monthly_series_by_period` variable. Print the result.
##### Are the two Series equivalent?
#### Result:

In [ ]:
series3 = pd.date_range(start='2019-01-01', end='2020-01-01', freq='M')
print(series3)
# series_data = pd.Series(index=series3)
# print(series_data)

In [ ]:
series4 = pd.date_range(start='2019-01-01', periods=12, freq='M')
print(series4)

#### Task 4
##### Create a NumPy array `abs_values` with values `[5, 8, 66, 4]` and convert it into a `Pandas Series` object. Assign it to variable `abs_series`.
##### Print the result.
##### Then print the results of the following operations:
- Get the shape of the Series
- Find the mean of the Series
- Find the median of the Series
- Find the standard deviation of the Series
- Get unique values in the Series
- Get the number of unique values in the Series
#### Here are some bonus questions that you could work on later
- Get counts of unique values in the Series
- Find the position of the minimum value in the Series
- Find the position of the maximum value in the Series
- Rank items in the Series in descending order
- Sort values in the Series
- Find sum of the Series
- Find cumulative sum of the Series
#### Result:

In [2]:
abs_values = np.array([5, 8, 66, 4])
print(abs_values.shape)
abs_values = pd.Series(abs_values)
print(abs_values)

(4,)
0     5
1     8
2    66
3     4
dtype: int64

In [ ]:
abs_values.shape

In [ ]:
abs_values.mean()

In [ ]:
abs_values.median()

In [ ]:
abs_values.std()

In [ ]:
abs_values.unique()

In [ ]:
abs_values.nunique()

In [ ]:
abs_values.value_counts()

In [ ]:
abs_values.idxmin()

In [ ]:
abs_values.idxmax()

In [ ]:
abs_values.sort_values(ascending=False)

In [3]:
print(abs_values.sum())
print(abs_values.cumsum())

83
0     5
1    13
2    79
3    83
dtype: int64

#### Answers for the bonus questions

In [ ]:
print(abs_series.value_counts())
print(abs_series.idxmin()) 
print(abs_series.idxmax())
print(abs_series.rank(ascending = False))
print(abs_series.sort_values())
print(abs_series.sum())
print(abs_series.cumsum())

#### Please refer to module 2 of DataWranglingInPython - DataWranglingWithPandas for Tasks 5-8
#### Task 5
##### Create a Pandas Series object from a list of groceries below. Assign it to a variable called `shopping_series` and print it.
- milk
- eggs
- peppers
- cheese
- tomatoes
##### Create a Series object called `prices` that contains the following values: [2.5, 3.99, 1.95, 5.99, 1.29].
##### Create a Series object called `num_items` that contains the following values: [1, 1, 2, 1, 3].
##### Combine the three `Series` objects described above into a single DataFrame called `shopping_cart` naming the columns as follows:
- `item_name`
- `item_price`
- `item_quantity`
##### Print the first few entries (i.e. the `head` of the DataFrame).
#### Result:

In [2]:
shopping_series = pd.Series(['milk', 'eggs', 'peppers', 'cheese', 'tomatoes'])
prices = pd.Series([2.5, 3.99, 1.95, 5.99, 1.29])
num_items = pd.Series([1, 1, 2, 1, 3])

shopping_cart = pd.DataFrame({'item_name': shopping_series, 'item_price': prices, 'item_quantity': num_items})
print(shopping_cart.head())

  item_name  item_price  item_quantity
0      milk        2.50              1
1      eggs        3.99              1
2   peppers        1.95              2
3    cheese        5.99              1
4  tomatoes        1.29              3

In [6]:
print(shopping_cart.info())
print(shopping_cart.values)

[['milk' 2.5 1]
 ['eggs' 3.99 1]
 ['peppers' 1.95 2]
 ['cheese' 5.99 1]
 ['tomatoes' 1.29 3]]

#### Task 6
##### Check the following characteristics of the `shopping_cart` object:
- Type
- Shape
- Show column names of the DataFrame
- Show information of the DataFrame
- Describe the DataFrame
##### How many columns are described in the last output? Why do you think that's the case?
##### What is the 75th percentile of the column `item_price`?
##### What is the standard deviation of the column `item_quantity`?
#### Result:

In [7]:
type(shopping_cart)

pandas.core.frame.DataFrame

In [8]:
shopping_cart.shape

(5, 3)

In [12]:
shopping_cart.columns

Index(['item_name', 'item_price', 'item_quantity'], dtype='object')

In [10]:
print(shopping_cart.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   item_name      5 non-null      object
 1   item_price     5 non-null      float64
 2   item_quantity  5 non-null      int64
dtypes: float64(1), int64(1), object(1)
memory usage: 248.0+ bytes
None

In [13]:
shopping_cart["item_price"].quantile(0.75)

3.99

In [14]:
shopping_cart["item_quantity"].std()

0.8944271909999159

#### Task 7
##### Perform the following on the `shopping_cart` DataFrame:
- Extract column `item_price`
- Extract columns `item_name` and`item_quantity`
- Extract the 3rd row
#### Result:

In [3]:
item_price = shopping_cart.item_price
print(item_price)

0    2.50
1    3.99
2    1.95
3    5.99
4    1.29
Name: item_price, dtype: float64

In [4]:
print(shopping_cart)

  item_name  item_price  item_quantity
0      milk        2.50              1
1      eggs        3.99              1
2   peppers        1.95              2
3    cheese        5.99              1
4  tomatoes        1.29              3

In [5]:
item_name = shopping_cart.item_name
item_quantity = shopping_cart.item_quantity
item_name, item_quantity

(0        milk
 1        eggs
 2     peppers
 3      cheese
 4    tomatoes
 Name: item_name, dtype: object,
 0    1
 1    1
 2    2
 3    1
 4    3
 Name: item_quantity, dtype: int64)

In [6]:
third_row = shopping_cart.iloc[2]

In [7]:
third_row

item_name        peppers
item_price          1.95
item_quantity          2
Name: 2, dtype: object

#### Task 8
##### Set the index of `shopping_cart` DataFrame to `item_name`. Print the updated DataFrame.
##### Print just the index of the `shopping_cart` DataFrame.
##### Look up the row of the `shopping_cart` by using the index value 'eggs'.
##### Reset index of the `shopping_cart`. Print the updated DataFrame.
#### Result:

In [9]:
shopping_cart.set_index('item_name', inplace = True)
shopping_cart

           item_price  item_quantity
item_name
milk             2.50              1
eggs             3.99              1
peppers          1.95              2
cheese           5.99              1
tomatoes         1.29              3

In [10]:
shopping_cart.index

Index(['milk', 'eggs', 'peppers', 'cheese', 'tomatoes'], dtype='object', name='item_name')

In [11]:
shopping_cart.loc['eggs']

item_price       3.99
item_quantity    1.00
Name: eggs, dtype: float64

In [12]:
shopping_cart.reset_index(inplace = True)
shopping_cart

  item_name  item_price  item_quantity
0      milk        2.50              1
1      eggs        3.99              1
2   peppers        1.95              2
3    cheese        5.99              1
4  tomatoes        1.29              3

#### Please refer to module 3 of DataWranglingInPython - DataWranglingWithPandas for Tasks 9-12
#### Task 9
##### Read in 'heart_failure_clinical_records_dataset.csv' into a variable called `ex_df` using Pandas.
##### Print the first 20 rows of the DataFrame.
#### Result:

In [1]:
from pathlib import Path
import pandas as pd
import numpy as np
# Set 'main_dir' to location of the project folder
home_dir = Path(".").resolve()
main_dir = home_dir.parent.parent
print(main_dir)
data_dir = str(main_dir) + "/IntermediateDataWrangling/data"
print(data_dir)
ex_df = pd.read_csv(str(data_dir)+'/'+ 'heart_failure_clinical_records_dataset.csv')
# ex_df = pd.read_csv("IntermediateDataWrangling/data/heart_failure_clinical_records_dataset.csv")

/workspaces/Data-Wrangling-with-Python
/workspaces/Data-Wrangling-with-Python/IntermediateDataWrangling/data

In [26]:
ex_df[:20]

,age,anaemia,creatinine_phosphokinase,diabetes,ejection_fraction,high_blood_pressure,platelets,serum_creatinine,serum_sodium,sex,smoking,time,death_event,id
0,75.0,0,582,0,20,1,265000.00,1.9,130,1,0,4,1,1
1,55.0,0,7861,0,38,0,263358.03,1.1,136,1,0,6,1,2
2,65.0,0,146,0,20,0,162000.00,1.3,129,1,1,7,1,3
3,50.0,1,111,0,20,0,210000.00,1.9,137,1,0,7,1,4
4,65.0,1,160,1,20,0,327000.00,2.7,116,0,0,8,1,5
5,90.0,1,47,0,40,1,204000.00,2.1,132,1,1,8,1,6
6,75.0,1,246,0,15,0,127000.00,1.2,137,1,0,10,1,7
7,60.0,1,315,1,60,0,454000.00,1.1,131,1,1,10,1,8
8,65.0,0,157,0,65,0,263358.03,1.5,138,0,0,10,1,9
9,80.0,1,123,0,35,1,388000.00,9.4,133,1,1,10,1,10
10,75.0,1,81,0,38,1,368000.00,4.0,131,1,1,10,1,11
11,62.0,0,231,0,25,1,253000.00,0.9,140,1,1,10,1,12
12,45.0,1,981,0,30,0,136000.00,1.1,137,1,0,11,1,13
13,50.0,1,168,0,38,1,276000.00,1.1,137,1,0,11,1,14
14,49.0,1,80,0,30,1,427000.00,1.0,138,0,0,12,0,15
15,82.0,1,379,0,50,0,47000.00,1.3,136,1,0,13,1,16
16,87.0,1,149,0,38,0,262000.00,0.9,140,1,0,14,1,17
17,45.0,0,582,0,14,0,166000.00,0.8,127,1,0,14,1,18
18,70.0,1,125,0,25,1,237000.00,1.0,140,0,0,15,1,19
19,48.0,1,582,1,55,0,87000.00,1.9,121,0,0,15,1,20

#### Task 10
##### Perform the following actions on `ex_df` object:
- Check the type of the object
- Get the shape of the object and save it to 2 variables and print both: `nrows` and `ncols`
#### Result:

In [29]:
type(ex_df)

pandas.core.frame.DataFrame

In [30]:
ex_df.shape

(299, 14)

In [31]:
nrows,ncols = ex_df.shape
print(nrows,ncols)

299 14

#### Task 11
##### Use the sample function to:
- print 3 random rows in ex_df
- print 0.1% random rows in 
#### Result:

In [32]:
ex_df.sample(3)

,age,anaemia,creatinine_phosphokinase,diabetes,ejection_fraction,high_blood_pressure,platelets,serum_creatinine,serum_sodium,sex,smoking,time,death_event,id
234,53.0,1,582,0,45,0,305000.0,1.1,137,1,1,209,0,235
285,55.0,1,170,1,40,0,336000.0,1.2,135,1,0,250,0,286
207,85.0,0,212,0,38,0,186000.0,0.9,136,1,0,187,0,208

In [39]:
# len(ex_df)
# ex_df.sample(int(0.001*len(ex_df)))
print(ex_df.sample(frac=0.001))

Empty DataFrame
Columns: [age, anaemia, creatinine_phosphokinase, diabetes, ejection_fraction, high_blood_pressure, platelets, serum_creatinine, serum_sodium, sex, smoking, time, death_event, id]
Index: []

#### Task 12
##### Inspect `ex_df` for the following information:
- columns
- data types
- info
- statistical summary (describe)
#### Result:

In [3]:
ex_df.columns

Index(['age', 'anaemia', 'creatinine_phosphokinase', 'diabetes',
       'ejection_fraction', 'high_blood_pressure', 'platelets',
       'serum_creatinine', 'serum_sodium', 'sex', 'smoking', 'time',
       'death_event', 'id'],
      dtype='object')

In [4]:
ex_df.dtypes

age                         float64
anaemia                       int64
creatinine_phosphokinase      int64
diabetes                      int64
ejection_fraction             int64
high_blood_pressure           int64
platelets                   float64
serum_creatinine            float64
serum_sodium                  int64
sex                           int64
smoking                       int64
time                          int64
death_event                   int64
id                            int64
dtype: object

In [3]:
ex_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 299 entries, 0 to 298
Data columns (total 14 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       299 non-null    float64
 1   anaemia                   299 non-null    int64
 2   creatinine_phosphokinase  299 non-null    int64
 3   diabetes                  299 non-null    int64
 4   ejection_fraction         299 non-null    int64
 5   high_blood_pressure       299 non-null    int64
 6   platelets                 299 non-null    float64
 7   serum_creatinine          299 non-null    float64
 8   serum_sodium              299 non-null    int64
 9   sex                       299 non-null    int64
 10  smoking                   299 non-null    int64
 11  time                      299 non-null    int64
 12  death_event               299 non-null    int64
 13  id                        299 non-null    int64
dtypes: float64(3), int64(11)
memory usage: 32.8 KB

In [4]:
ex_df.describe()

,age,anaemia,creatinine_phosphokinase,diabetes,ejection_fraction,high_blood_pressure,platelets,serum_creatinine,serum_sodium,sex,smoking,time,death_event,id
count,299.000000,299.000000,299.000000,299.000000,299.000000,299.000000,299.000000,299.00000,299.000000,299.000000,299.00000,299.000000,299.00000,299.000000
mean,60.833893,0.431438,581.839465,0.418060,38.083612,0.351171,263358.029264,1.39388,136.625418,0.648829,0.32107,130.260870,0.32107,150.000000
std,11.894809,0.496107,970.287881,0.494067,11.834841,0.478136,97804.236869,1.03451,4.412477,0.478136,0.46767,77.614208,0.46767,86.458082
min,40.000000,0.000000,23.000000,0.000000,14.000000,0.000000,25100.000000,0.50000,113.000000,0.000000,0.00000,4.000000,0.00000,1.000000
25%,51.000000,0.000000,116.500000,0.000000,30.000000,0.000000,212500.000000,0.90000,134.000000,0.000000,0.00000,73.000000,0.00000,75.500000
50%,60.000000,0.000000,250.000000,0.000000,38.000000,0.000000,262000.000000,1.10000,137.000000,1.000000,0.00000,115.000000,0.00000,150.000000
75%,70.000000,1.000000,582.000000,1.000000,45.000000,1.000000,303500.000000,1.40000,140.000000,1.000000,1.00000,203.000000,1.00000,224.500000
max,95.000000,1.000000,7861.000000,1.000000,80.000000,1.000000,850000.000000,9.40000,148.000000,1.000000,1.00000,285.000000,1.00000,299.000000

#### Please refer to module 4 of DataWranglingInPython - DataWranglingWithPandas for Tasks 13-16
#### Task 13
##### Find the number of unique values present in the columns of the DataFrame, store the result in the dictionary format with the name `ex_col_dict` and print the dictionary.
##### Identify and pick the column which has the least number of unique values from the dictionary.
##### Save the column as `ex_grouping_col` and print it.
#### Result:

In [5]:
ex_col_dict = ex_df.nunique().to_dict()
ex_col_dict
# ex_df.nunique()

{'age': 47,
 'anaemia': 2,
 'creatinine_phosphokinase': 208,
 'diabetes': 2,
 'ejection_fraction': 17,
 'high_blood_pressure': 2,
 'platelets': 176,
 'serum_creatinine': 40,
 'serum_sodium': 27,
 'sex': 2,
 'smoking': 2,
 'time': 148,
 'death_event': 2,
 'id': 299}

In [4]:
unique_values_per_column = ex_df.nunique()

# Find the column with the least number of unique values
ex_grouping_col = unique_values_per_column.idxmin()

print("Column with the least number of unique values:", ex_grouping_col)

Column with the least number of unique values: anaemia

In [5]:
ex_grouping_col

'anaemia'

#### Task 14
##### Group by the column `ex_grouping_col` and assign it to a DataFrame named `ex_grouped_df`.
##### Use the summary functions to get the count of ID variable for all the variables you just grouped in `ex_grouped_df`.
##### Assign the output to a DataFrame called `ex_df_ID` and print that DataFrame.
#### Result:

In [6]:
ex_grouped_df = ex_df.groupby(ex_grouping_col)
ex_grouped_df.head()

,age,anaemia,creatinine_phosphokinase,diabetes,ejection_fraction,high_blood_pressure,platelets,serum_creatinine,serum_sodium,sex,smoking,time,death_event,id
0,75.0,0,582,0,20,1,265000.00,1.9,130,1,0,4,1,1
1,55.0,0,7861,0,38,0,263358.03,1.1,136,1,0,6,1,2
2,65.0,0,146,0,20,0,162000.00,1.3,129,1,1,7,1,3
3,50.0,1,111,0,20,0,210000.00,1.9,137,1,0,7,1,4
4,65.0,1,160,1,20,0,327000.00,2.7,116,0,0,8,1,5
5,90.0,1,47,0,40,1,204000.00,2.1,132,1,1,8,1,6
6,75.0,1,246,0,15,0,127000.00,1.2,137,1,0,10,1,7
7,60.0,1,315,1,60,0,454000.00,1.1,131,1,1,10,1,8
8,65.0,0,157,0,65,0,263358.03,1.5,138,0,0,10,1,9
11,62.0,0,231,0,25,1,253000.00,0.9,140,1,1,10,1,12

In [16]:
ex_grouped_df.keys

'anaemia'

In [7]:
ex_df_ID = ex_grouped_df.count()[['id']]
print(ex_df_ID)

          id
anaemia
0        170
1        129

#### Task 15
##### Sort the values by ID.
#### Result:

In [8]:
sorted_df = ex_df_ID.sort_values(by='id')

In [9]:
sorted_df

          id
anaemia
1        129
0        170

#### Task 16
##### In `ex_df_ID`, create a new Boolean column (containing values True or False) called `over10000_ID` .
##### This indicates whether a row has a value for `ID` that is higher than 10000.
#### Result:

In [10]:
ex_df_ID['over10000_ID'] = ex_df_ID['id'] > 10000

In [11]:
ex_df_ID

          id  over10000_ID
anaemia
0        170         False
1        129         False

#### Please refer to module 5 of DataWranglingInPython - DataWranglingWithPandas for Tasks 17-20
#### Task 17
##### Subset the DataFrame to have the following variables: ['creatinine_phosphokinase', 'age', 'serum_sodium', 'platelets', 'time', 'serum_creatinine', 'ejection_fraction', 'sex', 'death_event', 'diabetes', 'smoking', 'anaemia', 'high_blood_pressure']. Print head of `ex_df_subset`.
##### Check if there are any NAs in the DataFrame and fill with mean if NAs are present.
#### Result:

#### Task 18
##### Group `ex_df` data by the variable `ex_grouping_col`. Save as `ex_grouped`.
##### Then group and summarize the numeric variables: ['creatinine_phosphokinase', 'age', 'serum_sodium', 'platelets', 'time', 'serum_creatinine', 'ejection_fraction'] using their means.
##### Save as `ex_grouped_mean` and print.
##### Reset its index and print the result.
#### Result:

#### Task 19
##### Notice the format of `ex_grouped_mean`. We wish to convert it from wide to long format.
##### Use the `pd.melt()` function and convert it to long format. Save as `ex_grouped_mean_long` and print the result.
#### Result:

#### Task 20
##### Now use the `pd.pivot()` function to convert `ex_grouped_mean_long` to wide format.
##### Save as `ex_grouped_mean_wide` and print.
#### Result: